/* global $ */
import OnScreen from 'onscreen';

export default function () {
    /*===============================================================
     * Вспомогательные CSS классы
     * =============================================================*/
    const classNames = {
        onScreen: 'js-on-screen',
    };

    /*===============================================================
     * Общие переменные
     * =============================================================*/
    const os = new OnScreen({
        tolerance: 200,
        debounce: 100,
        container: window,
    });

    /*===============================================================
     * Запуск анимации при появлении элемента на экране
     * =============================================================*/

    os.on('enter', `.${classNames.onScreen}`, (element) => {
    });
}
